<#1.	Создайте сценарии *.ps1 дл я задач из labwork 2, проверьте их работоспостобность. Каждый сценарий должен иметь параметры.
1.1.	Сохранить в текстовый файл на диске список запущенных(!) служб. Просмотреть содержимое диска. Вывести содержимое файла в консоль PS.
1.2.	Просуммировать все числовые значения переменных среды Windows. (Параметры не нужны)
1.3.	Вывести список из 10 процессов занимающих дольше всего процессор.Результат записывать в файл.
1.3.1.	Организовать запуск скрипта каждые 10 минут
1.4.	Подсчитать размер занимаемый файлами в папке (например C:\windows) за исключением файлов с заданным расширением(напрмер .tmp)
 
1.5.	Создать один скрипт, объединив 3 задачи:
1.5.1.	Сохранить в CSV-файле информацию обо всех обновлениях безопасности ОС.
1.5.2.	Сохранить в XML-файле информацию о записях одной ветви реестра HKLM:\SOFTWARE\Microsoft.
1.5.3.	Загрузить данные из полученного в п.1.5.1 или п.1.5.2 файла и вывести в виде списка  разным разными цветами
#> 

#2.	Работа с профилем
#2.1.	Создать профиль
New-Item -ItemType file -Path $profile –force 
notepad $PROFILE
#2.2.	В профиле изненить цвета в консоли PowerShell
#2.3.	Создать несколько собственный алиасов
#2.4.	Создать несколько констант
#2.5.	Изменить текущую папку
#2.6.	Вывести приветсвие
 
#2.7.	Проверить применение профиля
Test-Path $profile
#3.	Получить список всех доступных модулей
Get-Module -ListAvailable
